running apply,

```
$ terraform apply
random_id.webhook[0]: Refreshing state... [id=fN4megGWwoSOcRnlGFmTfm4DnBWrOStUb3Be35osTRUDvowWGoHIyptidvTjUjRh3EIKwvOfpS8GAeXU_1DbRQ]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0988ef8061c168c18]
module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:804464997158:cluster/atlantis]
aws_ssm_parameter.webhook[0]: Refreshing state... [id=/atlantis/webhook/secret]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a52402f9c48d4243]
aws_cloudwatch_log_group.atlantis: Refreshing state... [id=atlantis]
aws_iam_role.ecs_task_execution: Refreshing state... [id=atlantis-ecs_task_execution]
aws_ecs_task_definition.atlantis: Refreshing state... [id=atlantis]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-034e5c1a769317a97]
module.atlantis_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0b4d7af3d8c1b89b3]
module.alb_http_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-09f8d92fc7230a4d0]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-050e2315e9f815187]
module.alb_https_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0b4a288df1be09a26]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-05b8fae06a87ebd3c]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03ebe29153f12c96f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06dde7c780e76a707]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b654934d38cd7ef0]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00ecabbc692b7fd4c]
module.atlantis_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-3747965091]
module.alb_https_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-3151505782]
module.alb_https_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-1270101448]
module.alb_https_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-373428534]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-06b641555298c99f4]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0389fe7a13876d3d2]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-07cdab94e52aa5642]
module.alb_http_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-3251357202]
module.alb_http_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-2278016955]
module.alb_http_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1708536627]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05ff2c6c9c49e2d5b]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-061358dc273afde98]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06dde7c780e76a7071080289494]
module.atlantis_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1631643273]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:804464997158:loadbalancer/app/atlantis/96c7cdf6f70783d6]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-050e2315e9f8151871080289494]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:804464997158:targetgroup/atlantis/e455d930af7db7d6]
module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:804464997158:listener/app/atlantis/96c7cdf6f70783d6/f39c190f952cb927]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ecs_task_access_secrets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecs_task_access_secrets"  {
      ~ id      = "257833410" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "secretsmanager:GetSecretValue",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:us-east-1:804464997158:parameter/atlantis/webhook/secret"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              ~ (known after apply),
                # (1 unchanged element hidden)
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # aws_ecs_service.atlantis will be created
  + resource "aws_ecs_service" "atlantis" {
      + cluster                            = "arn:aws:ecs:us-east-1:804464997158:cluster/atlantis"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "atlantis"
      + platform_version                   = "LATEST"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "atlantis"
        }
      + task_definition                    = "atlantis:3"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "atlantis"
          + container_port   = 4141
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:804464997158:targetgroup/atlantis/e455d930af7db7d6"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0b4d7af3d8c1b89b3",
            ]
          + subnets          = [
              + "subnet-00ecabbc692b7fd4c",
              + "subnet-0b654934d38cd7ef0",
            ]
        }
    }

  # aws_iam_role_policy.ecs_task_access_secrets[0] will be created
  + resource "aws_iam_role_policy" "ecs_task_access_secrets" {
      + id     = (known after apply)
      + name   = "ECSTaskAccessSecretsPolicy"
      + policy = (known after apply)
      + role   = "atlantis-ecs_task_execution"
    }

  # aws_ssm_parameter.atlantis_github_user_token[0] will be created
  + resource "aws_ssm_parameter" "atlantis_github_user_token" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "/atlantis/github/user/token"
      + tags      = {
          + "Name" = "atlantis"
        }
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_ssm_parameter.atlantis_github_user_token[0]: Creating...
aws_ecs_service.atlantis: Creating...
aws_ecs_service.atlantis: Creation complete after 1s [id=arn:aws:ecs:us-east-1:804464997158:service/atlantis/atlantis]
aws_ssm_parameter.atlantis_github_user_token[0]: Creation complete after 1s [id=/atlantis/github/user/token]
data.aws_iam_policy_document.ecs_task_access_secrets: Reading... [id=257833410]
data.aws_iam_policy_document.ecs_task_access_secrets: Read complete after 0s [id=212208998]
aws_iam_role_policy.ecs_task_access_secrets[0]: Creating...
aws_iam_role_policy.ecs_task_access_secrets[0]: Creation complete after 0s [id=atlantis-ecs_task_execution:ECSTaskAccessSecretsPolicy]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```